app/controllers/schools_controller.rb

INSERT INTO "schools" ("name", "curriculum", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "Govt school"], ["curriculum", "chennai"], ["created_at", "2021-02-24 08:13:48.741764"], ["updated_at", "2021-02-24 08:13:48.741764"]]
---
	def create
		@school=School.new(school_params)
		if @school.save

SELECT  "schools".* FROM "schools" WHERE "schools"."id" = ? LIMIT 1  [["id", 1]]
---
	def show
		@school=School.find(params[:id])

SELECT  "schools".* FROM "schools" WHERE "schools"."id" = ? LIMIT 1  [["id", 1]]
---
	def edit
		@school=School.find(params[:id])

SELECT  "schools".* FROM "schools" WHERE "schools"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "schools" SET "curriculum" = ?, "updated_at" = ? WHERE "schools"."id" = ?  [["curriculum", "pusu"], ["updated_at", "2021-02-24 08:15:11.408689"], ["id", 1]]
---
	def update
		@school=School.find(params[:id])
		if @school.update(school_params)