app/controllers/standards_controller.rb

SELECT  "standards".* FROM "standards" WHERE "standards"."id" = ? LIMIT 1  [["id", 1]]
---
	def show
		@standard=Standard.find(params[:id])

SELECT  "standards".* FROM "standards" WHERE "standards"."id" = ? LIMIT 1  [["id", 1]]
---
	def edit
		@standard=Standard.find(params[:id])

SELECT "standards".* FROM "standards"
---
	def index
		@standards=Standard.all